<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Reshaping-Data" data-toc-modified-id="Reshaping-Data-1">Reshaping Data</a></span><ul class="toc-item"><li><span><a href="#Changing-Row-Indices" data-toc-modified-id="Changing-Row-Indices-1.1">Changing Row Indices</a></span></li><li><span><a href="#Long-and-Wide-Data-Formats" data-toc-modified-id="Long-and-Wide-Data-Formats-1.2">Long and Wide Data Formats</a></span></li><li><span><a href="#A-Quick-Note-about-pandas-Series" data-toc-modified-id="A-Quick-Note-about-pandas-Series-1.3">A Quick Note about <code>pandas</code> <code>Series</code></a></span></li></ul></li></ul></div>

# Reshaping Data

The usual preamble for importing the essential modules and configuring the plotting engine.

In [1]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns; sns.set()
sns.set(style="ticks", color_codes=True)
sns.set_context("notebook")

In [2]:
sns.set({ "figure.figsize": (12/1.5,8/1.5) })

We will make use of `gapminder` for illustration. As usual, note that the path to the data file should be changed to match the directory structure in your home area.

In [4]:
gm_df = pd.read_csv('gapminder2.tsv', sep='\t')

A quick reminder of structure and contents of the dataset:

In [5]:
gm_df.sample(5)

        country continent  year  lifeExp       pop     gdpPercap
1197   Paraguay  Americas  1997   69.400   5154123   4247.400261
395        Cuba  Americas  2007   78.273  11416987   8948.102923
710   Indonesia      Asia  1962   42.518  99028000    849.289770
907       Libya    Africa  1987   66.234   3799845  11770.589800
1502     Taiwan      Asia  1962   65.200  11918938   1822.879028

## Changing Row Indices

We have discussed in more than one occasion that DataFrames are indexed by **row** and **column** indices. By default, `pandas` created a range of integers for the **row labels**:

In [6]:
gm_df.index

RangeIndex(start=0, stop=1704, step=1)

And the **column labels** match the header of the `.csv` file:

In [7]:
gm_df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

To address one or more rows, one would normally use `.loc` with the corresponding labels:

In [8]:
gm_df.loc[249]

country        Canada
continent    Americas
year             1997
lifeExp         78.61
pop          30305843
gdpPercap     28954.9
Name: 249, dtype: object

In many scenarios, one might want to make a row index more meaningful, into something that corresponds to intrinsic properties of the data. For example, if you we were looking a student dataset, we could use student IDs or (albeit, not as good) full names. More often than not, row labels are useful when they stand as unique identifiers for observations.

We can use `.set_index()` and `.reset_index()` for turning a column into a row index, and vice-versa. Let us illustrate with a subset of `gapminder`.

In [9]:
australia_df = gm_df.loc[ gm_df['country']=='Australia' ]

In [10]:
australia_df

      country continent  year  lifeExp       pop    gdpPercap
60  Australia   Oceania  1952   69.120   8691212  10039.59564
61  Australia   Oceania  1957   70.330   9712569  10949.64959
62  Australia   Oceania  1962   70.930  10794968  12217.22686
63  Australia   Oceania  1967   71.100  11872264  14526.12465
64  Australia   Oceania  1972   71.930  13177000  16788.62948
65  Australia   Oceania  1977   73.490  14074100  18334.19751
66  Australia   Oceania  1982   74.740  15184200  19477.00928
67  Australia   Oceania  1987   76.320  16257249  21888.88903
68  Australia   Oceania  1992   77.560  17481977  23424.76683
69  Australia   Oceania  1997   78.830  18565243  26997.93657
70  Australia   Oceania  2002   80.370  19546792  30687.75473
71  Australia   Oceania  2007   81.235  20434176  34435.36744

I will take a subset of columns for an easier demonstration. Instead of `.loc` for selecting the columns of interest, I am droping those I do not wish to keep.

In [11]:
australia_df = australia_df.drop(columns=['country','continent', 'gdpPercap', 'pop'])

In [13]:
australia_df

    year  lifeExp
60  1952   69.120
61  1957   70.330
62  1962   70.930
63  1967   71.100
64  1972   71.930
65  1977   73.490
66  1982   74.740
67  1987   76.320
68  1992   77.560
69  1997   78.830
70  2002   80.370
71  2007   81.235

In [14]:
australia_df = australia_df.set_index('year')

In [15]:
australia_df

      lifeExp
year
1952   69.120
1957   70.330
1962   70.930
1967   71.100
1972   71.930
1977   73.490
1982   74.740
1987   76.320
1992   77.560
1997   78.830
2002   80.370
2007   81.235

In [16]:
australia_df.index

Int64Index([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
            2007],
           dtype='int64', name='year')

In [17]:
australia_df.loc[2002]

lifeExp    80.37
Name: 2002, dtype: float64

In [19]:
australia_df.loc[1992:2007]

      lifeExp
year
1992   77.560
1997   78.830
2002   80.370
2007   81.235

**checkpoint**:

Take a subset of `gapminder` for `Oceania` and `2007`; it makes sense to assign it to a variable (with a meaningful name). Then, make `country` the row index, and try some indexing expressions with `.loc` for selecting unique observations from that subset.

In [30]:
gm_oceania_2007_df = gm_df.loc[ (gm_df['continent']=='Oceania') & (gm_df['year']==2007)]

In [31]:
gm_oceania_2007_df.head()

          country continent  year  lifeExp       pop    gdpPercap
71      Australia   Oceania  2007   81.235  20434176  34435.36744
1103  New Zealand   Oceania  2007   80.204   4115771  25185.00911

In [32]:
gm_oceania_2007_df=gm_oceania_2007_df.set_index('country')

In [33]:
gm_oceania_2007_df

            continent  year  lifeExp       pop    gdpPercap
country
Australia     Oceania  2007   81.235  20434176  34435.36744
New Zealand   Oceania  2007   80.204   4115771  25185.00911

In [39]:
gm_oceania_2007_df.reset_index().reset_index().drop(columns='index')

       country continent  year  lifeExp       pop    gdpPercap
0    Australia   Oceania  2007   81.235  20434176  34435.36744
1  New Zealand   Oceania  2007   80.204   4115771  25185.00911

More than one column can be pushed into the row index; then, the latter becomes a **hierarchical index**. Each column occupies an index **level**. There are all sorts of complex operations and transformation that we can apply on and with them; for the moment, it suffices to realise that now, in order to address specific rows, one should use **tuples** representing combinations of index level labels.

In [40]:
oceania_sub_df = oceania_df.drop(columns=['continent', 'gdpPercap', 'pop'])

In [89]:
oceania_sub_df

          country  year  lifeExp
60      Australia  1952   69.120
61      Australia  1957   70.330
62      Australia  1962   70.930
63      Australia  1967   71.100
64      Australia  1972   71.930
65      Australia  1977   73.490
66      Australia  1982   74.740
67      Australia  1987   76.320
68      Australia  1992   77.560
69      Australia  1997   78.830
70      Australia  2002   80.370
71      Australia  2007   81.235
1092  New Zealand  1952   69.390
1093  New Zealand  1957   70.260
1094  New Zealand  1962   71.240
1095  New Zealand  1967   71.520
1096  New Zealand  1972   71.890
1097  New Zealand  1977   72.220
1098  New Zealand  1982   73.840
1099  New Zealand  1987   74.320
1100  New Zealand  1992   76.330
1101  New Zealand  1997   77.550
1102  New Zealand  2002   79.110
1103  New Zealand  2007   80.204

In [90]:
oceania_rsh_df = oceania_sub_df.set_index(['country', 'year'])

In [91]:
oceania_rsh_df

                  lifeExp
country     year
Australia   1952   69.120
            1957   70.330
            1962   70.930
            1967   71.100
            1972   71.930
            1977   73.490
            1982   74.740
            1987   76.320
            1992   77.560
            1997   78.830
            2002   80.370
            2007   81.235
New Zealand 1952   69.390
            1957   70.260
            1962   71.240
            1967   71.520
            1972   71.890
            1977   72.220
            1982   73.840
            1987   74.320
            1992   76.330
            1997   77.550
            2002   79.110
            2007   80.204

`country` is the **outermost level** (0), and `year` is the **inner most level** (1).

We should explore this topic further in the coming weeks but, if you would like to look ahead, the online documentation can help: https://pandas.pydata.org/pandas-docs/stable/user_guide/advanced.html#advanced-indexing-with-hierarchical-index. Also, our **Python Data Science Handbook**.

Selecting a single observation by using a **pair of row index labels**:

In [92]:
oceania_rsh_df.loc[ ('New Zealand', 2007) ]

lifeExp    80.204
Name: (New Zealand, 2007), dtype: float64

Ranges are now also pairs of labels:

In [93]:
oceania_rsh_df.loc[ ('New Zealand', 1952):('New Zealand', 1967) ]

                  lifeExp
country     year
New Zealand 1952    69.39
            1957    70.26
            1962    71.24
            1967    71.52

And partial matches using the outermost levels are possible:

In [94]:
oceania_rsh_df.loc[ 'New Zealand' ]

      lifeExp
year
1952   69.390
1957   70.260
1962   71.240
1967   71.520
1972   71.890
1977   72.220
1982   73.840
1987   74.320
1992   76.330
1997   77.550
2002   79.110
2007   80.204

**checkpoint**:

In a similar fashion, obtain a subset for 2007 observations and use both `continent` and `country` as row index. Try a few `.loc` expressions using pairs of continent and country labels, as well as partial matching on a single `continent`.

In [95]:
gm_2007_df=gm_df.loc[ gm_df['year']==2007 ]
gm_2007_df.head()

        country continent  year  lifeExp       pop     gdpPercap
11  Afghanistan      Asia  2007   43.828  31889923    974.580338
23      Albania    Europe  2007   76.423   3600523   5937.029526
35      Algeria    Africa  2007   72.301  33333216   6223.367465
47       Angola    Africa  2007   42.731  12420476   4797.231267
59    Argentina  Americas  2007   75.320  40301927  12779.379640

In [96]:
gm_2007_df=gm_2007_df.set_index(['continent','country']).sort_values(by=['continent','country']) #sort_index()
gm_2007_df.head()

                        year  lifeExp       pop     gdpPercap
continent country
Africa    Algeria       2007   72.301  33333216   6223.367465
          Angola        2007   42.731  12420476   4797.231267
          Benin         2007   56.728   8078314   1441.284873
          Botswana      2007   50.728   1639131  12569.851770
          Burkina Faso  2007   52.295  14326203   1217.032994

In [97]:
gm_2007_df.loc[('Europe','Germany')]

year         2.007000e+03
lifeExp      7.940600e+01
pop          8.240100e+07
gdpPercap    3.217037e+04
Name: (Europe, Germany), dtype: float64

In [98]:
gm_2007_df.loc['Africa']

                          year  lifeExp        pop     gdpPercap
country
Algeria                   2007   72.301   33333216   6223.367465
Angola                    2007   42.731   12420476   4797.231267
Benin                     2007   56.728    8078314   1441.284873
Botswana                  2007   50.728    1639131  12569.851770
Burkina Faso              2007   52.295   14326203   1217.032994
Burundi                   2007   49.580    8390505    430.070692
Cameroon                  2007   50.430   17696293   2042.095240
Central African Republic  2007   44.741    4369038    706.016537
Chad                      2007   50.651   10238807   1704.063724
Comoros                   2007   65.152     710960    986.147879
Congo, Dem. Rep.          2007   46.462   64606759    277.551859
Congo, Rep.               2007   55.322    3800610   3632.557798
Cote d'Ivoire             2007   48.328   18013409   1544.750112
Djibouti                  2007   54.791     496374   2082.481567
Egypt                     2007   71.338   80264543   5581.180998
Equatorial Guinea         2007   51.579     551201  12154.089750
Eritrea                   2007   58.040    4906585    641.369524
Ethiopia                  2007   52.947   76511887    690.805576
Gabon                     2007   56.735    1454867  13206.484520
Gambia                    2007   59.448    1688359    752.749726
Ghana                     2007   60.022   22873338   1327.608910
Guinea                    2007   56.007    9947814    942.654211
Guinea-Bissau             2007   46.388    1472041    579.231743
Kenya                     2007   54.110   35610177   1463.249282
Lesotho                   2007   42.592    2012649   1569.331442
Liberia                   2007   45.678    3193942    414.507341
Libya                     2007   73.952    6036914  12057.499280
Madagascar                2007   59.443   19167654   1044.770126
Malawi                    2007   48.303   13327079    759.349910
Mali                      2007   54.467   12031795   1042.581557
Mauritania                2007   64.164    3270065   1803.151496
Mauritius                 2007   72.801    1250882  10956.991120
Morocco                   2007   71.164   33757175   3820.175230
Mozambique                2007   42.082   19951656    823.685621
Namibia                   2007   52.906    2055080   4811.060429
Niger                     2007   56.867   12894865    619.676892
Nigeria                   2007   46.859  135031164   2013.977305
Reunion                   2007   76.442     798094   7670.122558
Rwanda                    2007   46.242    8860588    863.088464
Sao Tome and Principe     2007   65.528     199579   1598.435089
Senegal                   2007   63.062   12267493   1712.472136
Sierra Leone              2007   42.568    6144562    862.540756
Somalia                   2007   48.159    9118773    926.141068
South Africa              2007   49.339   43997828   9269.657808
Sudan                     2007   58.556   42292929   2602.394995
Swaziland                 2007   39.613    1133066   4513.480643
Tanzania                  2007   52.517   38139640   1107.482182
Togo                      2007   58.420    5701579    882.969944
Tunisia                   2007   73.923   10276158   7092.923025
Uganda                    2007   51.542   29170398   1056.380121
Zambia                    2007   42.384   11746035   1271.211593
Zimbabwe                  2007   43.487   12311143    469.709298

## Long and Wide Data Formats

In short: typically, the columns of the dataset represent properties of the data but, in a number of situations (say, because of the way the data was recorded, or for making comparisons and plotting easier), values are shown are columns.

In [99]:
oceania_rsh_df.head()

                lifeExp
country   year
Australia 1952    69.12
          1957    70.33
          1962    70.93
          1967    71.10
          1972    71.93

In [100]:
# don't worry about the expression below and how unstack works; right now,
# I just wanted to produce a small dataset with values as column labels
oceania_wide_df = oceania_rsh_df.unstack('year')['lifeExp']
oceania_wide_df

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
country,,,,,,,,,,,,
Australia,69.12,70.33,70.93,71.10,71.93,73.49,74.74,76.32,77.56,78.83,80.37,81.235
New Zealand,69.39,70.26,71.24,71.52,71.89,72.22,73.84,74.32,76.33,77.55,79.11,80.204

In [104]:
oceania_wide_df.index

Index(['Australia', 'New Zealand'], dtype='object', name='country')

In [105]:
oceania_wide_df.columns

Int64Index([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
            2007],
           dtype='int64', name='year')

In [106]:
oceania_wide_df.mean()

year
1952    69.2550
1957    70.2950
1962    71.0850
1967    71.3100
1972    71.9100
1977    72.8550
1982    74.2900
1987    75.3200
1992    76.9450
1997    78.1900
2002    79.7400
2007    80.7195
dtype: float64

**Aggregation functions** that we have applied on single columns before work on **subsets of DataFrames** too. We can specify whether they should work across columns or rows.

In [107]:
oceania_wide_df.mean(axis='columns')

country
Australia      74.662917
New Zealand    73.989500
dtype: float64

In [108]:
oceania_wide_df.mean(axis='rows')

year
1952    69.2550
1957    70.2950
1962    71.0850
1967    71.3100
1972    71.9100
1977    72.8550
1982    74.2900
1987    75.3200
1992    76.9450
1997    78.1900
2002    79.7400
2007    80.7195
dtype: float64

In [109]:
oceania_wide_df.max(axis='columns')

country
Australia      81.235
New Zealand    80.204
dtype: float64

In [110]:
oceania_wide_df.max(axis='rows')

year
1952    69.390
1957    70.330
1962    71.240
1967    71.520
1972    71.930
1977    73.490
1982    74.740
1987    76.320
1992    77.560
1997    78.830
2002    80.370
2007    81.235
dtype: float64

**checkpoint**:

On our wider Oceania dataset, produce a subset for observations concerning `New Zealand` from `1992` to `2007`.

In [122]:
oceania_rsh_df.loc[('New Zealand',1992):('New Zealand',2007)]

                  lifeExp
country     year
New Zealand 1992   76.330
            1997   77.550
            2002   79.110
            2007   80.204

Usefully, one can swaps rows with columns via a **transpose** operation:

In [126]:
oceania_wide_df

year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
country,,,,,,,,,,,,
Australia,69.12,70.33,70.93,71.10,71.93,73.49,74.74,76.32,77.56,78.83,80.37,81.235
New Zealand,69.39,70.26,71.24,71.52,71.89,72.22,73.84,74.32,76.33,77.55,79.11,80.204

In [127]:
oceania_wide_df.T

country  Australia  New Zealand
year
1952        69.120       69.390
1957        70.330       70.260
1962        70.930       71.240
1967        71.100       71.520
1972        71.930       71.890
1977        73.490       72.220
1982        74.740       73.840
1987        76.320       74.320
1992        77.560       76.330
1997        78.830       77.550
2002        80.370       79.110
2007        81.235       80.204

In [128]:
oceania_wide_df.T.index

Int64Index([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
            2007],
           dtype='int64', name='year')

In [129]:
oceania_wide_df.T.columns

Index(['Australia', 'New Zealand'], dtype='object', name='country')

## A Quick Note about `pandas` `Series`

For the time being, think of it as a **unidimensional DataFrame**. A row is a Series whose index is the column labels, mapped into values. A column is a Series with the index being the row labels, mapped into values.

In [130]:
oceania_wide_df.loc['New Zealand']

year
1952    69.390
1957    70.260
1962    71.240
1967    71.520
1972    71.890
1977    72.220
1982    73.840
1987    74.320
1992    76.330
1997    77.550
2002    79.110
2007    80.204
Name: New Zealand, dtype: float64

In [134]:
oceania_wide_df.loc['New Zealand'][1987]

74.32

In [135]:
oceania_wide_df.loc['New Zealand'].index

Int64Index([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
            2007],
           dtype='int64', name='year')

In [136]:
oceania_wide_df.loc['New Zealand'].values

array([69.39 , 70.26 , 71.24 , 71.52 , 71.89 , 72.22 , 73.84 , 74.32 ,
       76.33 , 77.55 , 79.11 , 80.204])

In [140]:
oceania_wide_df[[2007]]

year           2007
country
Australia    81.235
New Zealand  80.204

In [138]:
oceania_wide_df[2007].index

Index(['Australia', 'New Zealand'], dtype='object', name='country')

In [139]:
oceania_wide_df[2007].values

array([81.235, 80.204])

Most operations work the same in either **DataFrames** or **Series**; it is worth pointing out that `Series` can have hierarchical indices too.